const quotes = [
  {
    creator: 'У. Клемент Стоун',
    phrase: 'Чітка мета – перший крок до будь-якого досягнення.',
  },
  {
    creator: 'Китайська приказка',
    phrase: 'Швидко, це повільно без зупинок',
  },
  {
    creator: 'Альберт Ейнштейн',
    phrase: 'Прагніть бути не просто успішною людиною, а й цінною.',
  },
  {
    creator: 'Чарльз Свіндол',
    phrase:
      'Життя на 10% складається з того, що з вами відбувається і 90%, з того, як ви на це реагуєте.',
  },
  {
    creator: 'Христофор Колумб',
    phrase:
      'Ти ніколи не перепливеш океан, якщо боятимешся втратити берег із виду.',
  },
  {
    creator: 'Зіг Зиглар',
    phrase:
      'Говорять, що мотивація триває не довго. Що ж, свіжість після ванни – теж. Тому піклуватися про них варто щодня.',
  },
  {
    creator: 'Антуан де Сент-Екзюпері',
    phrase:
      'Досконалість – це не тоді, коли нічого додати, а тоді, коли нічого відняти.',
  },
  {
    creator: 'Теодор Рузвельт',
    phrase: 'Повірте, що зможете, і пів шляху вже пройдено.',
  },
  {
    creator: 'Хелен Келлер',
    phrase:
      'Коли закриваються одні двері в щастя, відкривається інша. Але ми часто занадто довго дивимося на закриті двері, щоб побачити, що нам відкрилося.',
  },
  {
    creator: 'Майя Енджелоу',
    phrase:
      'Життя вимірюється не кількістю наших вдохів, а кількістю моментів, від яких перехоплює дихання.',
  },
  {
    creator: 'Шеріл Сендберг',
    phrase:
      'Якщо вам запропонували місце на космічному кораблі, не запитуйте, яке місце! Встрибуйте всередину!',
  },
  {
    creator: 'Латинська приказка',
    phrase:
      'Відчуйте попутний вітер у вашому вітрилі. Рухайтеся.Якщо немає вітру, беріться за весла.',
  },
  {
    creator: 'Невідомий автор',
    phrase:
      'Ти не впадеш, якщо не підіймаєшся в гору. Але яка радість від цілого життя, проведеного на землі.',
  },
  {
    creator: 'Вінс Ломбарді',
    phrase:
      'Одна перемога не веде до успіху, на відміну від постійного бажання перемагати.',
  },
  {
    creator: 'Альберт Ейнштейн',
    phrase:
      'Людина, яка ніколи не здійснювала помилок, ніколи не пробувала зробити щось по-іншому.',
  },
  {
    creator: 'Фарра Грей',
    phrase:
      'Здійснюйте свої мрії, або хтось візьме вас на роботу для здійснення своїх.',
  },
  {
    creator: 'Опра Уінфрі',
    phrase:
      'Якщо ви цінуєте те, що у вас вже є в житті, ви завжди отримуватимете ще більше. Якщо думати лише про те, чого у вас немає – вам ніколи не буде досить.',
  },
  {
    creator: 'Далай-лама',
    phrase: 'Запам’ятайте, іноді не отримати бажаного – найбільша удача.',
  },
  {
    creator: 'Бенджамін Франклін',
    phrase:
      'Або напишіть книгу, варту уваги, або зробіть щось, варте написання книги.',
  },
  {
    creator: 'Стів Джобс',
    phrase: 'Єдиний спосіб зробити видатну роботу – щиро любити те, що робиш.',
  },
  {
    creator: 'Зіг Зіглар',
    phrase: 'Якщо ти можеш щось уявити – ти можеш цього досягти!',
  },
  {
    creator: 'Дана Уайт',
    phrase:
      'Я ненавиджу вихідні! Я хочу, щоб як найшвидше наступив понеділок. Ось наскільки я люблю те чим займаюсь. Якщо це не ваш менталітет і ви боїтесь понеділків, то зупинітся і знайдіть іншу роботу. Це вас вбиває!',
  },
  {
    creator: 'Генрі Форд',
    phrase:
      'Людина вмирає тоді, коли перестає змінюватися, а похорони - просто формальність.',
  },
  {
    creator: 'Генрі Форд',
    phrase:
      'Якби я робив тільки те, що хочуть від мене люди, вони б досі їздили на каретах.',
  },
  {
    creator: 'Генрі Форд',
    phrase: 'Найкраща робота - це високооплачуване хобі.',
  },
  {
    creator: 'Генрі Форд',
    phrase:
      'Молода людина повинна шукати ту єдину іскру індивідуальності, яка відрізняє її від інших людей, і розпалювати її всіма силами. Не давайте іскрі згаснути.',
  },
  {
    creator: 'Генрі Форд',
    phrase: 'Все можна зробити краще, ніж робилось до тепер',
  },
];
